
&НаКлиенте
Процедура Сформировать(Команда)

	ТабДок = СформироватьТабличныйДокумент(Период);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьТабличныйДокумент(парПериод)
	
	ТабДок = Новый ТабличныйДокумент;

	Макет = Отчеты.ЗанятостьСборщиков_СКД.ПолучитьМакет("Макет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачисленияСотрудникамОбороты.ФизическоеЛицо КАК Сборщик,
	|	ПРЕДСТАВЛЕНИЕ(НачисленияСотрудникамОбороты.ФизическоеЛицо),
	|	НачисленияСотрудникамОбороты.Компьютер,
	|	ПРЕДСТАВЛЕНИЕ(НачисленияСотрудникамОбороты.Компьютер),
	|	НачисленияСотрудникамОбороты.КоличествоОборот КАК Количество,
	|	НачисленияСотрудникамОбороты.СуммаОборот КАК Сумма
	|ИЗ
	|	РегистрНакопления.НачисленияСотрудникам.Обороты(&НачПериода, &КонПериода, , ) КАК НачисленияСотрудникамОбороты
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма)
	|ПО
	|	Сборщик";
	
	Запрос.УстановитьПараметр("НачПериода", парПериод.ДатаНачала);
	Запрос.УстановитьПараметр("КонПериода", парПериод.ДатаОкончания);

	Результат = Запрос.Выполнить();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьСборщик = Макет.ПолучитьОбласть("Сборщик");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаСборщик = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаСборщик.Следующий() Цикл
		ОбластьСборщик.Параметры.Заполнить(ВыборкаСборщик);
		ТабДок.Вывести(ОбластьСборщик, ВыборкаСборщик.Уровень());

		ВыборкаДетальныеЗаписи = ВыборкаСборщик.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
		КонецЦикла;
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);

	
	Возврат ТабДок;
	
КонецФункции

