Процедура ПерепровестиРеализацииРасчетСебестоимости() Экспорт

	МоментВремениТоварная = Последовательности.Товарная.ПолучитьГраницу();
	МоментВремениСебестоимость = Последовательности.Себестоимость.ПолучитьГраницу();

	Если (МоментВремениСебестоимость.Сравнить(МоментВремениТоварная) = 1) Тогда
		Момент = МоментВремениТоварная;
	Иначе
		Момент = МоментВремениСебестоимость;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товарная.Регистратор КАК Ссылка
	|ИЗ
	|	Последовательность.Товарная КАК Товарная
	|ГДЕ
	|	Товарная.МоментВремени > &Момент
	|	И Товарная.Регистратор.Проведен = ИСТИНА
	|УПОРЯДОЧИТЬ ПО
	|	Товарная.МоментВремени";

	Запрос.УстановитьПараметр("Момент", Момент);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();

		ДокОбъект.ДополнительныеСвойства.Вставить("РасчетСебестоимости", Истина);

		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);

	КонецЦикла;

КонецПроцедуры