
Процедура ОбработкаПроведения(Отказ, Режим)
	
		
    Движение = Движения.Касса.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
    Движение.Период = Дата;
    Движение.Сумма = Сумма;
    

    Движение = Движения.Взаиморасчеты.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период = Дата;
    Движение.Контрагент = Контрагент;
    Движение.Сумма = Сумма;
	
	
	Движения.Касса.Записывать = Истина;
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.Касса.БлокироватьДляИзменения = Истина;
	Движения.Взаиморасчеты.БлокироватьДляИзменения = Истина;

	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КассаОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.Касса.Остатки(&Период, ) КАК КассаОстатки
	|ГДЕ
	|	КассаОстатки.СуммаОстаток < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаиморасчетыОстатки.СуммаОстаток + ВзаиморасчетыОстатки.Контрагент.СуммаДолга КАК Лимит
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(&Период, Контрагент = &Контрагент) КАК ВзаиморасчетыОстатки
	|ГДЕ
	|	ВзаиморасчетыОстатки.СуммаОстаток - ВзаиморасчетыОстатки.Контрагент.СуммаДолга > 0";
	
		Период = ?(Режим = РежимПроведенияДокумента.Оперативный
		, Неопределено
		, Новый Граница( МоментВремени()   , ВидГраницы.Включая) );
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	РезультатЗапроса = МассивРезультатов.Получить(0);
	
	Если РезультатЗапроса.Пустой() = Ложь Тогда
		
		Отказ = Истина;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий(); 			
				
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не хватает денег в кассе!! Нехватка " + ВыборкаДетальныеЗаписи.СуммаОстаток + " у.е.";
		Сообщение.Поле = "Сумма";
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.КлючДанных = Ссылка;
		Сообщение.Сообщить();
	
	КонецЕсли;
	
	РезультатЗапроса = МассивРезультатов.Получить(1);
	
	Если РезультатЗапроса.Пустой() = Ложь Тогда
		
		Отказ = Истина;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий(); 			
				
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Это контрагент превысил лимит задолженности на " + ВыборкаДетальныеЗаписи.Лимит + " у.е.";
		Сообщение.Поле = "Сумма";
		//Сообщение.ПутьКДанным = "Объект";
		//Сообщение.КлючДанных = Ссылка;
		Сообщение.УстановитьДанные(ЭтотОбъект);  //В данном случае этот метод заменяет две закоментированные строчки!
		Сообщение.Сообщить();
	
	КонецЕсли;


КонецПроцедуры


