
&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	ПолучитьДанныеПоЗаказу();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеПоЗаказу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Клиент,
	|	ЗаказПокупателя.Компьютер
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка = &Заказ";

	Запрос.УстановитьПараметр("Заказ", Объект.ДокументОснование);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Объект.Клиент = ВыборкаДетальныеЗаписи.Клиент;
		Объект.Компьютер = ВыборкаДетальныеЗаписи.Компьютер;

	Иначе	
		
		Объект.Клиент = Справочники.Контрагенты.ПустаяСсылка();
		Объект.Компьютер = Справочники.Компьютеры.ПустаяСсылка();
		
	КонецЕсли;;
	
КонецПроцедуры

