
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Взаиморасчеты.Записывать = Истина;
    Движение = Движения.Взаиморасчеты.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
    Движение.Период = Дата;
    Движение.Контрагент = Контрагент;
    Движение.Сумма = Сумма;

	
	Движения.Касса.Записывать = Истина;
    Движение = Движения.Касса.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период = Дата;
    Движение.Сумма = Сумма;

КонецПроцедуры


