
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ПланированиеОказанияУслуг.Записывать = Истина;
	
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		
		Движение = Движения.ПланированиеОказанияУслуг.Добавить();
		
		Движение.Период = Дата;
		Движение.СервисМенеджер = СервисМенеджер;
		Движение.Услуга = ТекСтрокаСостав.Услуга;
		Движение.Контрагент = ТекСтрокаСостав.Контрагент;
		Движение.ДокументОснование = ТекСтрокаСостав.ДокументОснование;
		Движение.ПланируемаяДатаВыполнения = ТекСтрокаСостав.ПланируемаяДатаВыполнения;
		Движение.РеальнаяДатаВыполнения = Дата;
	КонецЦикла;

КонецПроцедуры
