
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ДополнительныеСвойства.Свойство("РасчетСебестоимости") = Ложь Тогда
		
		#Область ОперативноеПроведение
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РеализацияТоваровИУслугТовары.Номенклатура,
		|	РеализацияТоваровИУслугТовары.Количество
		|ИЗ
		|	Документ.РеализацияТоваровИУслуг.Товары КАК РеализацияТоваровИУслугТовары
		|ГДЕ
		|	РеализацияТоваровИУслугТовары.Ссылка = &Ссылка
		|	И РеализацияТоваровИУслугТовары.Номенклатура.Услуга = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Движение = Движения.ОстаткиТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Склад = Склад;
			Движение.Количество = Выборка.Количество;
			
			Движение = Движения.СвободныеОстатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Склад = Склад;
			Движение.Количество = Выборка.Количество;
			
			
		КонецЦикла;
		
		//Будем анализировать увеличение позиций в документе при перепроведении
		//только в оперативном режиме
		Если Режим = РежимПроведенияДокумента.Оперативный Тогда
			
			МВТ = Новый МенеджерВременныхТаблиц;
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МВТ;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СвободныеОстатки.Номенклатура КАК Номенклатура,
			|	СвободныеОстатки.Количество КАК Количество
			|ПОМЕСТИТЬ ВТПередЗаписью
			|ИЗ
			|	РегистрНакопления.СвободныеОстатки КАК СвободныеОстатки
			|ГДЕ
			|	СвободныеОстатки.Регистратор = &Регистратор";
			
			Запрос.УстановитьПараметр("Регистратор", Ссылка);
			
			Запрос.Выполнить();
			
			
		КонецЕсли;
		
		
		Движения.СвободныеОстатки.Записывать = Истина;
		Движения.СвободныеОстатки.БлокироватьДляИзменения = Истина;
		Движения.Записать();
		
		//В зависимости от режима проведения выполняем разный запрос
		//В оперативном режиме считаем остатки только у увеличенных позиций
		//в неоперативном режиме считаем остатки по всем позициям
		
		Запрос = Новый Запрос;
		
		Если Режим = РежимПроведенияДокумента.Оперативный Тогда
			
			
			Запрос.МенеджерВременныхТаблиц = МВТ;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СвободныеОстатки.Номенклатура КАК Номенклатура,
			|	СвободныеОстатки.Количество КАК Количество
			|ПОМЕСТИТЬ ВТОбъединение
			|ИЗ
			|	РегистрНакопления.СвободныеОстатки КАК СвободныеОстатки
			|ГДЕ
			|	СвободныеОстатки.Регистратор = &Регистратор
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВТПередЗаписью.Номенклатура,
			|	-1 * ВТПередЗаписью.Количество
			|ИЗ
			|	ВТПередЗаписью КАК ВТПередЗаписью
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТОбъединение.Номенклатура КАК Номенклатура,
			|	СУММА(ВТОбъединение.Количество) КАК Количество
			|ПОМЕСТИТЬ ВТСписок
			|ИЗ
			|	ВТОбъединение КАК ВТОбъединение
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТОбъединение.Номенклатура
			|
			|ИМЕЮЩИЕ
			|	СУММА(ВТОбъединение.Количество) > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
			|	СвободныеОстаткиОстатки.КоличествоОстаток КАК КоличествоОстаток,
			|	"" по данным оперативных остатоков ТМЦ "" КАК ТекстПериодОстатка
			|ИЗ
			|	РегистрНакопления.СвободныеОстатки.Остатки(
			|			,
			|			Склад = &Склад
			|				И Номенклатура В
			|					(ВЫБРАТЬ
			|						ВТСписок.Номенклатура КАК Номенклатура
			|					ИЗ
			|						ВТСписок КАК ВТСписок)) КАК СвободныеОстаткиОстатки
			|ГДЕ
			|	СвободныеОстаткиОстатки.КоличествоОстаток < 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТПередЗаписью";
			
		Иначе
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СвободныеОстатки.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ ВТСписок
			|ИЗ
			|	РегистрНакопления.СвободныеОстатки КАК СвободныеОстатки
			|ГДЕ
			|	СвободныеОстатки.Регистратор = &Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
			|	СвободныеОстаткиОстатки.КоличествоОстаток КАК КоличествоОстаток,
			|	"" по данным оперативных остатоков ТМЦ "" КАК ТекстПериодОстатка
			|ИЗ
			|	РегистрНакопления.СвободныеОстатки.Остатки(
			|			,
			|			Склад = &Склад
			|				И Номенклатура В
			|					(ВЫБРАТЬ
			|						ВТСписок.Номенклатура КАК Номенклатура
			|					ИЗ
			|						ВТСписок КАК ВТСписок)) КАК СвободныеОстаткиОстатки
			|ГДЕ
			|	СвободныеОстаткиОстатки.КоличествоОстаток < 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОстаткиТоваровОстатки.Номенклатура КАК Номенклатура,
			|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
			|	""  на дату документа "" КАК ТекстПериодОстатка
			|ИЗ
			|	РегистрНакопления.СвободныеОстатки.Остатки(
			|			&Период,
			|			Склад = &Склад
			|				И Номенклатура В
			|					(ВЫБРАТЬ
			|						ВТСписок.Номенклатура КАК Номенклатура
			|					ИЗ
			|						ВТСписок КАК ВТСписок)) КАК ОстаткиТоваровОстатки
			|ГДЕ
			|	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
			
			Период = Новый Граница( МоментВремени()   , ВидГраницы.Включая);
			
			Запрос.УстановитьПараметр("Период", Период);
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Регистратор", Ссылка);
		Запрос.УстановитьПараметр("Склад", Склад);
		
		Если Режим = РежимПроведенияДокумента.Оперативный Тогда
			
			//Менеджер временных таблиц нам нужен только в оперативном режиме
			МВТ.Закрыть();
			
		КонецЕсли;
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Для Каждого РезультатЗапроса Из МассивРезультатов Цикл
			
			Если РезультатЗапроса.Колонки.Найти("Номенклатура") = Неопределено Тогда
			
				Продолжить;
			
			КонецЕсли;
						
			Если РезультатЗапроса.Пустой() = Ложь Тогда
				
				Отказ = Истина;
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
				Сообщить("Нет " +  ВыборкаДетальныеЗаписи.Номенклатура
				+ ". Нехватка " + ВыборкаДетальныеЗаписи.ТекстПериодОстатка + " составляет " + ВыборкаДетальныеЗаписи.КоличествоОстаток);
					
				КонецЦикла;

			КонецЕсли;
			
		КонецЦикла;
		
		
		
		Если Отказ = Истина Тогда
			
			Сообщить("Не проведен документ " + Ссылка);
			Возврат;
			
		КонецЕсли;
		
		
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			
			Движение = Движения.Продажи.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Контрагент = Контрагент;
			Движение.Склад = Склад;
			Движение.Менеджер = Менеджер;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.Сумма = ТекСтрокаТовары.Сумма;
			Движение.Себестоимость = 0;
			
		КонецЦикла;
		
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Сумма = Товары.Итог("Сумма");
		
		Движение = Движения.ЗаданияНаРасчетСебестоимости.Добавить();
		Движение.Накладная = Ссылка;
		
		
		Движения.Взаиморасчеты.Записывать = Истина;
		Движения.ОстаткиТоваров.Записывать = Истина;
		Движения.Продажи.Записывать = Истина;
		Движения.ТоварыВРезерве.Записывать = Истина;
		Движения.СебестоимостьТоваров.Записывать = Истина;
		Движения.СебестоимостьТоваровПоПартиям.Записывать = Истина;
		Движения.ЗаданияНаРасчетСебестоимости.Записывать = Истина;
		
		#Область ПланированиеОказанияУслуг
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РеализацияТовары.Номенклатура,
		|	РеализацияТовары.Сумма,
		|	РеализацияТовары.Количество
		|ИЗ
		|	Документ.РеализацияТоваровИУслуг.Товары КАК РеализацияТовары
		|ГДЕ
		|	РеализацияТовары.Ссылка = &Ссылка
		|	И РеализацияТовары.Номенклатура.Услуга = ИСТИНА";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Движение = Движения.ПланированиеОказаниеУслуг.Добавить();
			
			Движение.Период = Дата;
			Движение.Услуга = Выборка.Номенклатура;
			Движение.Контрагент = Контрагент;
			Движение.ДокументОснование = Ссылка;
			
		КонецЦикла;
		
		Движения.ПланированиеОказаниеУслуг.Записывать = Истина;
		
		#КонецОбласти
		
		#КонецОбласти
		
		
	Иначе
		
		#Область РасчетСебестоимости
		//Сегодня работем в этой области!!
		Сообщить("Расчет себестоимости по документу " + Ссылка);
		
		
		#КонецОбласти
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарезервироватьТовары() Экспорт
	
	Отказ = Ложь;    //Это объявление переменной
	
	НачатьТранзакцию();
	
	Записать(РежимЗаписиДокумента.Запись);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровИУслугТовары.Номенклатура,
	|	РеализацияТоваровИУслугТовары.Количество
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Товары КАК РеализацияТоваровИУслугТовары
	|ГДЕ
	|	РеализацияТоваровИУслугТовары.Ссылка = &Ссылка
	|	И РеализацияТоваровИУслугТовары.Номенклатура.Услуга = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ТоварыВРезерве.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = Выборка.Количество;
		
		Движение = Движения.СвободныеОстатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = Выборка.Количество;
		
	КонецЦикла;
	
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвободныеОстатки.Номенклатура КАК Номенклатура,
	|	СвободныеОстатки.Количество КАК Количество
	|ПОМЕСТИТЬ ВТПередЗаписью
	|ИЗ
	|	РегистрНакопления.СвободныеОстатки КАК СвободныеОстатки
	|ГДЕ
	|	СвободныеОстатки.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Запрос.Выполнить();
	
	
	Движения.СвободныеОстатки.Записывать = Истина;
	Движения.СвободныеОстатки.БлокироватьДляИзменения = Истина;
	Движения.Записать();
	
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвободныеОстатки.Номенклатура КАК Номенклатура,
	|	СвободныеОстатки.Количество КАК Количество
	|ПОМЕСТИТЬ ВТОбъединение
	|ИЗ
	|	РегистрНакопления.СвободныеОстатки КАК СвободныеОстатки
	|ГДЕ
	|	СвободныеОстатки.Регистратор = &Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТПередЗаписью.Номенклатура,
	|	-1 * ВТПередЗаписью.Количество
	|ИЗ
	|	ВТПередЗаписью КАК ВТПередЗаписью
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОбъединение.Номенклатура КАК Номенклатура,
	|	СУММА(ВТОбъединение.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТСписок
	|ИЗ
	|	ВТОбъединение КАК ВТОбъединение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТОбъединение.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТОбъединение.Количество) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
	|	СвободныеОстаткиОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.СвободныеОстатки.Остатки(
	|			&Период,
	|			Склад = &Склад
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТСписок.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ВТСписок КАК ВТСписок)) КАК СвободныеОстаткиОстатки
	|ГДЕ
	|	СвободныеОстаткиОстатки.КоличествоОстаток < 0";
	
	
	Период = Неопределено; //Механизм резервирования не "исторический". Резервируем реальные остатки.
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МВТ.Закрыть();
	
	
	Если  РезультатЗапроса.Пустой() = Ложь  Тогда
		
		Отказ = Истина;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Сообщить("Для установки резерва нет " + ВыборкаДетальныеЗаписи.Номенклатура
			+ ". Нехватка " + ВыборкаДетальныеЗаписи.КоличествоОстаток);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Отказ = Истина Тогда
		
		ОтменитьТранзакцию();
		Возврат;
		
	Иначе
		
		Движения.ТоварыВРезерве.Записать();
		
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	
КонецПроцедуры
