
&НаКлиенте
Процедура КомпьютерПриИзменении(Элемент)
	
	ПолучитьТиповуюСпецификациюКомпьютера();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьТиповуюСпецификациюКомпьютера()
	
	УстановитьДоступностьСпецификацииКомпьютера();
	
	Если Объект.Компьютер = Справочники.Компьютеры.ОсобаяКонфигурация Тогда 
		Объект.СпецификацияКомпьютера.Очистить();
		Возврат;
	КонецЕсли;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпецификацииКомпьютеров.СвойствоКомпьютера КАК Свойство,
		|	СпецификацииКомпьютеров.Комплектующая,
		|	СпецификацииКомпьютеров.Количество
		|ИЗ
		|	РегистрСведений.СпецификацииКомпьютеров КАК СпецификацииКомпьютеров
		|ГДЕ
		|	СпецификацииКомпьютеров.Компьютер = &Компьютер";

	Запрос.УстановитьПараметр("Компьютер", объект.Компьютер);

	Результат = Запрос.Выполнить();

	Объект.СпецификацияКомпьютера.Загрузить(Результат.Выгрузить());
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьСпецификацииКомпьютера()
	
	Если Объект.Компьютер = Справочники.Компьютеры.ОсобаяКонфигурация Тогда 
		
		Элементы.СпецификацияКомпьютера.Доступность = Истина;
		
	Иначе
		
		Элементы.СпецификацияКомпьютера.Доступность = Ложь;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДоступностьСпецификацииКомпьютера();
	
КонецПроцедуры


