
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Список.Отбор.Элементы.Количество() > 0 Тогда
		
		Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
			
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Компьютер") Тогда 
				
				Если ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Справочник.Компьютеры.ОсобаяКонфигурация") Тогда 
					
					КоманднаяПанель.Доступность = Ложь;
					
				КонецЕсли;
				
				Прервать;
			КонецЕсли;
			
		КонецЦикла;                             
		
	КонецЕсли;
	
	
КонецПроцедуры
