



&НаСервере
Процедура Заполнить_НаСервере()

	Перейти ~Метка1;  //Оператор безусловного перехода на метку (GoTo)
	
	Объект.Состав.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"";
	
	Запрос.УстановитьПараметр("СервисМенеджер", Объект.СервисМенеджер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		НоваяСтрока = Объект.Состав.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
	~Метка1: //Метка, куда безусловно переходим!
	
КонецПроцедуры


&НаКлиенте
Процедура Заполнить_(Команда)
	Заполнить_НаСервере();
КонецПроцедуры

