



&НаСервере
Процедура Заполнить_НаСервере()

	//Возврат; // Заглушка
	
	Объект.Состав.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланированиеОказаниеУслугСрезПоследних.СервисМенеджер,
		|	ПланированиеОказаниеУслугСрезПоследних.Услуга,
		|	ПланированиеОказаниеУслугСрезПоследних.Контрагент,
		|	ПланированиеОказаниеУслугСрезПоследних.ДокументОснование,
		|	МАКСИМУМ(ПланированиеОказаниеУслугСрезПоследних.ПланируемаяДатаВыполнения) КАК ПланируемаяДатаВыполнения,
		|	МАКСИМУМ(ПланированиеОказаниеУслугСрезПоследних.РеальнаяДатаВыполнения) КАК РеальнаяДатаВыполнения
		|ИЗ
		|	РегистрСведений.ПланированиеОказаниеУслуг.СрезПоследних(, СервисМенеджер = &СервисМенеджер) КАК ПланированиеОказаниеУслугСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ПланированиеОказаниеУслугСрезПоследних.ДокументОснование,
		|	ПланированиеОказаниеУслугСрезПоследних.Услуга,
		|	ПланированиеОказаниеУслугСрезПоследних.Контрагент,
		|	ПланированиеОказаниеУслугСрезПоследних.СервисМенеджер
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ПланированиеОказаниеУслугСрезПоследних.ПланируемаяДатаВыполнения) <> ДАТАВРЕМЯ(1, 1, 1) И
		|	МАКСИМУМ(ПланированиеОказаниеУслугСрезПоследних.РеальнаяДатаВыполнения) = ДАТАВРЕМЯ(1, 1, 1)";
	
	Запрос.УстановитьПараметр("СервисМенеджер", Объект.СервисМенеджер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		НоваяСтрока = Объект.Состав.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура Заполнить_(Команда)
	Заполнить_НаСервере();
КонецПроцедуры

