
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьТекущийОстатокНаСервере();
	
КонецПроцедуры

//--------------------------------------------------------
&НаКлиенте
Процедура ОбновитьТекущийОстаток(Команда)
	ОбновитьТекущийОстатокНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьТекущийОстатокНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	КассаОстатки.СуммаОстаток КАК СуммаОстаток
	                |ИЗ
	                |	РегистрНакопления.Касса.Остатки(&Дата, ) КАК КассаОстатки";

	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ТекущийОстаток = ВыборкаДетальныеЗаписи.СуммаОстаток;
		
	КонецЦикла;
	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КассаОбороты.СуммаПриход КАК ОборотПриход,
	               |	КассаОбороты.СуммаРасход КАК ОборотРасход
	               |ИЗ
	               |	РегистрНакопления.Касса.Обороты(&Дата1, &Дата2, , ) КАК КассаОбороты";
	
	Запрос.УстановитьПараметр("Дата1", ДобавитьМесяц(НачалоМесяца(ТекущаяДата()),-1));
	Запрос.УстановитьПараметр("Дата2", (НачалоМесяца(ТекущаяДата())-1));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ОборотПриход = ВыборкаДетальныеЗаписи.ОборотПриход;
		ОборотРасход = ВыборкаДетальныеЗаписи.ОборотРасход;
		
	КонецЦикла;
	
КонецПроцедуры


//--------------------------------------------------------

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ПолучитьТекущийОстаток",60,Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТекущийОстаток() Экспорт 

	ОбновитьТекущийОстатокНаСервере();

КонецПроцедуры // ПолучитьТекущийОстаток()


