Процедура ОбработкаПроведения(Отказ, Режим)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ПоступлениеТовары.Номенклатура,
		|	ПоступлениеТовары.Количество,
		|	ПоступлениеТовары.Сумма
		|ИЗ
		|	Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеТовары
		|ГДЕ
		|	ПоступлениеТовары.Ссылка = &Ссылка
		|	И ПоступлениеТовары.Номенклатура.Услуга = ЛОЖЬ";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Движение = Движения.СебестоимостьТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		Движение.Себестоимость = ВыборкаДетальныеЗаписи.Сумма;

		Движение = Движения.СебестоимостьТоваровПоПартиям.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Партия = Ссылка;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		Движение.Себестоимость = ВыборкаДетальныеЗаписи.Сумма;

		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Склад = Склад;
		Движение.ОтветственныйЗаЗакупки = Ответственный;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;

		Движение = Движения.СвободныеОстатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;

	КонецЦикла;

	Движение = Движения.Взаиморасчеты.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Сумма = Товары.Итог("Сумма");

	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.СвободныеОстатки.Записывать = Истина;
	Движения.СебестоимостьТоваров.Записывать = Истина;
	Движения.СебестоимостьТоваровПоПартиям.Записывать = Истина;
	Движения.Взаиморасчеты.Записывать = Истина;

	Движения.ЗаказыПоставщикам.Записывать = Истина;

	Для Каждого ТекСтрокаТовары Из Товары Цикл

		Движение = Движения.ЗаказыПоставщикам.Добавить();

		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;

		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.ЗаказПоставщику = Заказ;

		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Сумма = ТекСтрокаТовары.Сумма;

	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда

		Если ДанныеЗаполнения.Проведен = Ложь Тогда
			Возврат;
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Контрагент КАК Контрагент,
		|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Склад КАК Склад,
		|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Ответственный КАК Ответственный,
		|	ЗаказыПоставщикамОстатки.Номенклатура,
		|	ЗаказыПоставщикамОстатки.КоличествоОстаток КАК Количество,
		|	ЗаказыПоставщикамОстатки.СуммаОстаток КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЗаказыПоставщикамОстатки.КоличествоОстаток = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЗаказыПоставщикамОстатки.СуммаОстаток / ЗаказыПоставщикамОстатки.КоличествоОстаток
		|	КОНЕЦ КАК Цена
		|ИЗ
		|	РегистрНакопления.ЗаказыПоставщикам.Остатки(, ЗаказПоставщику = &ЗаказПоставщику) КАК ЗаказыПоставщикамОстатки";

		Запрос.УстановитьПараметр("ЗаказПоставщику", ДанныеЗаполнения);

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.Количество;
			НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.Сумма;
			НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.Цена;

		КонецЦикла;

		//Данные в переменной ВыборкаДетальныеЗаписи Не очищаются!!
		Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
		Склад = ВыборкаДетальныеЗаписи.Склад;
		Ответственный = ВыборкаДетальныеЗаписи.Ответственный;
		Заказ = ДанныеЗаполнения;

	КонецЕсли;

КонецПроцедуры

