
Процедура ОбработкаПроведения(Отказ, Режим)
	
		
    Движение = Движения.Касса.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
    Движение.Период = Дата;
    Движение.Сумма = Сумма;

	Движения.Касса.Записывать = Истина;
	Движения.Касса.БлокироватьДляИзменения = Истина;

	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	КассаОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.Касса.Остатки(&Период, ) КАК КассаОстатки
	|ГДЕ
	|	КассаОстатки.СуммаОстаток < 0
	|";
	
	Период = ?(Режим = РежимПроведенияДокумента.Оперативный
	, Неопределено
	, Новый Граница( МоментВремени()   , ВидГраницы.Включая) );
	
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() = Ложь Тогда
		
		Отказ = Истина;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий(); 			
		
		Сообщение = Новый СообщениеПользователю;   //Вместо метода сообщить!!
		Сообщение.Текст = "Не хватает денег в кассе!! Нехватка " + ВыборкаДетальныеЗаписи.СуммаОстаток + " у.е.";
		Сообщение.Поле = "Сумма";            //Не обязательные свойства
		Сообщение.ПутьКДанным = "Объект";    //Только если хотим "прилепить" ярлычек
		Сообщение.КлючДанных = Ссылка;       //к полю формы
		Сообщение.Сообщить();
	
	КонецЕсли;
	
	
	Движения.Взаиморасчеты.Записывать = Истина;
	
	Движение = Движения.Взаиморасчеты.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период = Дата;
    Движение.Контрагент = Контрагент;
    Движение.Сумма = Сумма;


КонецПроцедуры



//Процедура ОбработкаПроведения(Отказ, Режим)


//	Движения.Касса.Записывать = Истина;
//    Движение = Движения.Касса.Добавить();
//    Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
//    Движение.Период = Дата;
//    Движение.Сумма = Сумма;
//    

//	Движения.Взаиморасчеты.Записывать = Истина;
//    Движение = Движения.Взаиморасчеты.Добавить();
//    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
//    Движение.Период = Дата;
//    Движение.Контрагент = Контрагент;
//    Движение.Сумма = Сумма;


//КонецПроцедуры


