Процедура ПроверитьПервыйЗапуск() Экспорт
	
	Если Константы.ПервыйЗапуск.Получить() = Ложь Тогда
		
		Константы.ПервыйЗапуск.Установить(Истина);
		
		ОбработатьДокументы();
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьДокументы()
	
	ТекМесяц = НачалоМесяца(ТекущаяДата());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровИУслуг.Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваровИУслуг КАК ПоступлениеТоваровИУслуг
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПоступлениеТоваровИУслуг.МоментВремени УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровИУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияТоваровИУслуг.МоментВремени УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПолучениеДенег.Ссылка
		|ИЗ
		|	Документ.ПолучениеДенег КАК ПолучениеДенег
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПолучениеДенег.МоментВремени УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыплатаДенег.Ссылка
		|ИЗ
		|	Документ.ВыплатаДенег КАК ВыплатаДенег
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВыплатаДенег.МоментВремени УБЫВ";
	
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	//--Поступления--
	
	ВыборкаДетальныеЗаписи = МассивРезультатовЗапроса[0].Выбрать();
	
	Разница = 2;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		ДокументОбъект.Дата = ТекМесяц - Разница;
		
		Попытка
			
			Если ДокументОбъект.Проведен Тогда
				
				ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
			Иначе	
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "" + ОписаниеОшибки();
			Сообщение.Сообщить();
			
		КонецПопытки;
		
		Разница = Разница + 24*60*60*(12.3);
		
	КонецЦикла;
	
	//--Реализации--
	
	ВыборкаДетальныеЗаписи = МассивРезультатовЗапроса[1].Выбрать();
	
	Разница = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		ДокументОбъект.Дата = ТекМесяц - Разница;
		
		Попытка
		
			Если ДокументОбъект.Проведен Тогда
				
				ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
			Иначе	
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "" + ОписаниеОшибки();
			Сообщение.Сообщить();
			
		КонецПопытки;
		
		Разница = Разница + 24*60*60*(12.3);
		
	КонецЦикла;
	
	//--Поступления денег--
	
	ВыборкаДетальныеЗаписи = МассивРезультатовЗапроса[2].Выбрать();
	
	Разница = 3000;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		ДокументОбъект.Дата = ТекМесяц - Разница;
		
		Попытка
		
			Если ДокументОбъект.Проведен Тогда
				
				ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
			Иначе	
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "" + ОписаниеОшибки();
			Сообщение.Сообщить();
			
		КонецПопытки;
		
		Разница = Разница + 24*60*60*(12.3);
		
	КонецЦикла;
	
	//--Выплаты денег--
	
	ВыборкаДетальныеЗаписи = МассивРезультатовЗапроса[3].Выбрать();
	
	Разница = 2000;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		ДокументОбъект.Дата = ТекМесяц - Разница;
		
		Попытка
		
			Если ДокументОбъект.Проведен Тогда
				
				ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
			Иначе	
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "" + ОписаниеОшибки();
			Сообщение.Сообщить();
			
		КонецПопытки;
		
		Разница = Разница + 24*60*60*(12.3);
		
	КонецЦикла;

КонецПроцедуры

